---
kind: property
id: P:Autodesk.Revit.DB.Structure.FabricArea.MinorLapSpliceLength
source: html/49211af1-a01d-a89a-79de-af8b87bf5c7c.htm
---
# Autodesk.Revit.DB.Structure.FabricArea.MinorLapSpliceLength Property

The fabric lap splice length in the fabric distribution in the minor direction.

## Syntax (C#)
```csharp
public double MinorLapSpliceLength { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: minorLapSpliceLength is greater than the half of the overall width.